import numpy as np

# 1. Ваши собственные числа (Lambda) из предыдущего шага
lambdas = np.array([2.3119409, 0.88286459, 0.64019081, 0.1650037])
#lambdas = np.array([1.523, 0.476])
# 2. Матрица нормированных собственных векторов V (из вашего вывода Python)
V = np.array([
    [ 0.59595346,  0.22398766, -0.27704903, -0.71966161],
    [-0.42499889,  0.50502794, -0.74552851,  0.09224949],
    [ 0.4949787,  -0.480383,   -0.54920543,  0.47180679],
    [ 0.46820028,  0.68118168,  0.25652384,  0.5009746 ]
])
#V = np.array([
#    [0.707,  0.707],
#    [0.707,  -0.707],
 
#])

# 3. Создаем диагональную матрицу корней из собственных чисел (Lambda^1/2)
# По формуле: A = V * Lambda^(1/2)
lambda_sqrt_diag = np.diag(np.sqrt(lambdas))

# 4. Вычисляем матрицу факторного отображения A
A = np.dot(V, lambda_sqrt_diag)
A_final = A.T
A_inv = np.linalg.inv(A_final)
print("--- 7. Матрица факторного отображения (A) ---")
print(A_final)
print("--- 7. Матрица факторного отображения (A) ---")
print(A_inv)
# Пояснение для отчета:
print("\nПроверка (сумма квадратов элементов первого столбца должна быть равна lambda1):")
print(f"Сумма квадратов a_r1: {np.sum(A[:, 0]**2):.6f} (ожидалось: {lambdas[0]:.6f})")